MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32A103VE/mcu.h
/*!
 * @file        apm32a10x.h
 *
 * @brief       CMSIS Cortex-M3 Device Peripheral Access Layer Header File.
 *
 * @details     This file contains all the peripheral register's definitions, bits definitions and memory mapping
 *
 * @version     V1.0.0
 *
 * @date        2023-03-25
 *
 * @attention
 *
 *  Copyright (C) 2023 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

/* Define to prevent recursive inclusion */
#ifndef __APM32A10X_H
#define __APM32A10X_H

#ifdef __cplusplus
extern "C" {
#endif

/*!
 *  APM32A10X_LD: APM32 Low    density devices, the Flash memory density ranges between 16 and 32 Kbytes.
 *  APM32A10X_MD: APM32 Medium density devices, the Flash memory density ranges between 64 and 128 Kbytes.
 *  APM32A10X_HD: APM32 High   density devices, the Flash memory density ranges between 256 and 512 Kbytes.
 */
// Note: Added for MikroE implementation.
#define APM32A10X_LD
#if !defined (APM32A10X_LD)  && !defined (APM32A10X_MD) && !defined (APM32A10X_HD)
#error "Please select a the target APM32A10x device used in your application (in apm32a10x.h file)"
#endif

/** @addtogroup CMSIS
  @{
*/

/** @addtogroup APM32A10x
  * @brief Peripheral Access Layer
  @{
*/

/** @defgroup HSE_Macros
  @{
*/

/**
 * @brief Define Value of the External oscillator in Hz
 */
#ifndef HSE_VALUE
#define HSE_VALUE                  ((uint32_t)8000000)
#endif

/* Time out for HSE start up */
#define HSE_STARTUP_TIMEOUT         ((uint16_t)0x05000)

/* Value of the Internal oscillator in Hz */
#define HSI_VALUE                   ((uint32_t)8000000)

/**@} end of group HSE_Macros */

/** @defgroup APM32A10x_StdPeripheral_Library_Version
  @{
*/

/**
 * @brief APM32A10x Standard Peripheral Library version number
 */
#define __APM32A10X_STDPERIPH_VERSION_MAIN   (0x01) /*!< [31:24] main version */
#define __APM32A10X_STDPERIPH_VERSION_SUB1   (0x00) /*!< [23:16] sub1 version */
#define __APM32A10X_STDPERIPH_VERSION_SUB2   (0x07) /*!< [15:8]  sub2 version */
#define __APM32A10X_STDPERIPH_VERSION_RC     (0x00) /*!< [7:0]  release candidate */
#define __APM32A10X_STDPERIPH_VERSION       ( (__APM32A10X_STDPERIPH_VERSION_MAIN << 24)\
                                             |(__APM32A10X_STDPERIPH_VERSION_SUB1 << 16)\
                                             |(__APM32A10X_STDPERIPH_VERSION_SUB2 << 8)\
                                             |(__APM32A10X_STDPERIPH_VERSION_RC))

/**@} end of group APM32F0xx_StdPeripheral_Library_Version */

/** @defgroup Configuraion_for_CMSIS
  @{
*/

/* APM32 devices does not provide an MPU */
#define __MPU_PRESENT                  0
/* APM32 uses 4 Bits for the Priority Levels  */
#define __NVIC_PRIO_BITS                4
/* Set to 1 if different SysTick Config is used */
#define __Vendor_SysTickConfig          0

/**@} end of group Configuraion_for_CMSIS */

/** @defgroup Peripheral_Enumerations
  @{
*/

/**
 * @brief APM32A10x Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */
typedef enum IRQn
{
    /******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                             */
    MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M3 Memory Management Interrupt              */
    BusFault_IRQn               = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                      */
    UsageFault_IRQn             = -10,    /*!< 6 Cortex-M3 Usage Fault Interrupt                    */
    SVCall_IRQn                 = -5,     /*!< 11 Cortex-M3 SV Call Interrupt                       */
    DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M3 Debug Monitor Interrupt                 */
    PendSV_IRQn                 = -2,     /*!< 14 Cortex-M3 Pend SV Interrupt                       */
    SysTick_IRQn                = -1,     /*!< 15 Cortex-M3 System Tick Interrupt                   */

    /******  APM32 specific Interrupt Numbers *********************************************************/
    WWDT_IRQn                   = 0,      /*!< Window WatchDog Interrupt                            */
    PVD_IRQn                    = 1,      /*!< PVD through EINT Line detection Interrupt            */
    TAMPER_IRQn                 = 2,      /*!< Tamper Interrupt                                     */
    RTC_IRQn                    = 3,      /*!< RTC global Interrupt                                 */
    FLASH_IRQn                  = 4,      /*!< FLASH global Interrupt                               */
    RCM_IRQn                    = 5,      /*!< RCM global Interrupt                                 */
    EINT0_IRQn                  = 6,      /*!< EINT Line0 Interrupt                                 */
    EINT1_IRQn                  = 7,      /*!< EINT Line1 Interrupt                                 */
    EINT2_IRQn                  = 8,      /*!< EINT Line2 Interrupt                                 */
    EINT3_IRQn                  = 9,      /*!< EINT Line3 Interrupt                                 */
    EINT4_IRQn                  = 10,     /*!< EINT Line4 Interrupt                                 */
    DMA1_Channel1_IRQn          = 11,     /*!< DMA1 Channel 1 global Interrupt                      */
    DMA1_Channel2_IRQn          = 12,     /*!< DMA1 Channel 2 global Interrupt                      */
    DMA1_Channel3_IRQn          = 13,     /*!< DMA1 Channel 3 global Interrupt                      */
    DMA1_Channel4_IRQn          = 14,     /*!< DMA1 Channel 4 global Interrupt                      */
    DMA1_Channel5_IRQn          = 15,     /*!< DMA1 Channel 5 global Interrupt                      */
    DMA1_Channel6_IRQn          = 16,     /*!< DMA1 Channel 6 global Interrupt                      */
    DMA1_Channel7_IRQn          = 17,     /*!< DMA1 Channel 7 global Interrupt                      */

